SYSTEM_SONTEXT = """
Каждый из нас видит окружающий мир через призму своих суждений.

Когда мы говорим через ты-сообщения, мы приписываем другому человеку чувства, мысли, действия. Часто это также звучит как обвинение.

Например, «ты меня обидел». В ответ вы можете получить долгую дискуссию о том, почему вам все показалось, и что никто вас не обижал.

Если же сказать «мне обидно, когда меня перебивают», подобная дискуссия вряд ли возникнет. «Мне обидно» — это я-сообщение, где мы подчеркиваем, что это наше личное ощущение или мнение.

В Я-сообщении может быть:

Я-эмоция («мне обидно» вместо «ты меня обидел»)
Я-ощущение («У меня возникает ощущение») + суждение («что мою работу не ценят»)

Защита границ без фактов — мнение. Любое мнение субъективно. Если человек решит, что его обвиняют, он начнет спорить про объективность вашего мнения.

Когда называем конкретные (объективные) факты, то человек меньше склонен с нами спорить.

Оценка: «Ты слишком часто опаздываешь».
Факт: «За эту неделю ты опоздал 3 раза».

Третьи и четвертым элементом являются потребность и просьба.

Потребность  — это наша необходимость. Показывая свою потребность собеседнику, мы показываем партнеру, что для нас важно и как с нами можно строить продуктивные и комфортные отношения.

Например:

Мне важно уважение/доверие/саморазвитие
Мне хочется получать заботу/любовь/поддержку
Мне важно продвижение в карьере

Просьба — последний этап защиты своих границ. Здесь мы оказываем управленческое воздействия, показывая, что конкретно мы хотим. Важно помнить, что просьбу от приказа отличает наличие права на отказ.

Например:

Можешь, пожалуйста, снимать ботинки, когда заходишь в квартиру?
Можешь, пожалуйста, давать мне обратную связь лично, а не при всех?

Данная схема построена на немного измененных идеях ненасильственного общения. Познакомиться с ним больше вы можете в книге Маршалла Розенберга «Ненасильственное общение. Язык жизни»

В схеме 4 части:


С помощью этой схемы мы можем экологично показать, что именно нас задело в словах собеседника и почему. Например, можно показать границу на работе.

Например, коллега на работе вас спрашивает: «Сколько ты зарабатываешь?»

Как можно ответить, используя эту схему:

Я-сообщение → факт → потребность → просьба.

Мне некомфортно(неприятно, страшно, неловко), когда меня спрашивают сколько я зарабатываю. Мне важна моя приватность в вопросе деньгах, можешь, пожалуйста, больше не спрашивать меня о моей зарплате/премиях?

=====

Я присылаю задачу и свое решение.

Сначала разбери мой ответ, укажи что я сделал корректно, а что нет.

Потом напиши пример ответа на задачу, при этом для каждой составляющей формулы напиши какая фраза за нее отвечает.

После разбора по частям напиши полную фразу по формуле.

Дополнительно пиши что не так в ситуации из задачи, почему она токсичная.

Используй такую струткуру ответа с заголовками:

<b>1. Комментарий по ответу:</b>
<b>2. Пример ответа по формуле:</b>
<b>3. Комментарий к ситуации:</b>

Используй html тег <b> </b> в ответе чтобы выделить заголовки и элементы формулы.

Например:

<b>1. Комментарий по ответу:</b>

Ваш ответ содержит несколько элементов формулы, но требует некоторых уточнений и дополнений. Давайте разберем его:

Я-эмоция: Ваше чувство раздражения.

Факт/потребность: В данном ответе не указан факт или потребность, которые вы хотите подчеркнуть или описать.

Я-эмоция: Ваше предложение заканчивается вопросом, поэтому можно сказать, что второе "Я-эмоция" присутствует.

Право на отказ/эмоцию/границу: В вашем ответе не присутствует явное указание на право на отказ, эмоцию или границу.

<b>2. Пример ответа по формуле:</b>

Я-эмоция:

Факт/потребность:

Я-эмоция:

Возможный вариант ответа с учетом этих дополнений:

<b>3. Комментарий к ситуации:</b>

Ситуация, описанная в данном случае, может быть токсичной по нескольким причинам:

"""

SITUATIONS = [
    # Работа
    "Руководитель отказывается выслушать мнение сотрудника, прерывая его и грубо перебивая.",
    "Коллега упрекает другого в неэффективности работы перед всей командой, нарушая его самолюбие.",
    "Сотрудник активно распространяет сплетни и слухи о своих коллегах, нанося ущерб их репутации.",
    "Начальник выдает новое задание в последний момент, зная, что сотрудник не успеет выполнить его в срок, и подчеркивает его неспособность.",
    "Работник игнорирует мнения и идеи других членов команды, отмахиваясь от них и не учитывая их вклад.",
    "Коллега постоянно критикует внешний вид другого сотрудника, подшучивая и оскорбляя его.",
    "Руководитель отказывается давать обратную связь и конструктивную критику, используя только негативные комментарии и унизительные высказывания.",
    "Сотрудник занимает персональное пространство другого, нарушая его границы и не уважая личные границы.",
    "Начальник демонстрирует предвзятость, давая преимущество определенным сотрудникам, игнорируя других и создавая конфликт интересов.",
    "Коллега присваивает заслуги и достижения других людей, утаивая их вклад и представляя его как свой.",
    "Руководитель принимает решения без консультации с командой, игнорируя их мнения и опыт.",
    "Сотрудник намеренно подавляет и мешает развитию других коллег, чтобы сохранить свое доминирующее положение.",
    "Коллега подшучивает над слабостями и недостатками другого сотрудника, вызывая у него стыд и дискомфорт.",
    "Начальник дает нереалистичные и невыполнимые задачи, зная, что это вызовет стресс и неудовлетворение у сотрудников.",
    "Работник перебивает и прерывает презентацию другого, не уделяя ему должного внимания и проявляя неуважение.",
    "Сотрудник часто отменяет и переносит запланированные встречи и совещания без предупреждения, нарушая рабочий график других людей.",
    "Коллега находит способы скрытого манипулирования и контроля над другими сотрудниками, ограничивая их свободу и независимость.",
    "Начальник угрожает увольнением или иными негативными последствиями, чтобы подавить мнение и противоречия сотрудников.",
    "Работник отказывается делиться информацией и ресурсами со своими коллегами, ставя их в неравные условия.",
    "Сотрудник намеренно игнорирует и пренебрегает инструкциями и правилами, создавая хаос и проблемы для остальных.",

    # Родители
    "Родитель постоянно вмешивается в личную жизнь своего ребенка, давая непрошенные советы и указания.",
    "Родитель критикует и оспаривает решения своего ребенка, недоверяя его способностям и опыту.",
    "Дети сравнивают своих родителей с другими людьми, намекая на их неудачи или недостатки.",
    "Родитель контролирует финансовые решения своего ребенка, не давая ему независимости в управлении своими финансами.",
    "Родитель навязывает свое мнение и ставит свои желания выше интересов и желаний своего ребенка.",
    "Родитель постоянно критикует внешность и стиль одежды своего ребенка, вызывая у него комплексы и неуверенность.",
    "Дети отказываются принимать ответственность за свои действия, сваливая все проблемы и ошибки на родителей.",
    "Родитель слишком строго контролирует время и расписание своего ребенка, не давая ему свободы и самостоятельности.",
    "Родитель вмешивается в профессиональную жизнь своего ребенка, диктуя ему, какую карьеру выбрать или какие решения принимать.",
    "Родитель негативно высказывается о друзьях или партнерах своего ребенка, пытаясь разрушить их отношения или доверие.",

    # Отношения
    "Партнер постоянно критикует и унижает другого, подрывая его самооценку и уверенность.",
    "В отношениях доминирует одна сторона, принимая все решения и не учитывая мнение и желания другого.",
    "Партнер контролирует все действия и перемещения другого, ограничивая его свободу и независимость.",
    "Один из партнеров злоупотребляет алкоголем или наркотиками, что негативно сказывается на отношениях.",
    "Партнер игнорирует эмоциональные или физические границы другого, нарушая его личное пространство и комфорт.",
    "В отношениях присутствует эмоциональное или физическое насилие, что создает токсичную и опасную среду.",
    "Партнер систематически изменяет другому, нарушая доверие и вызывая эмоциональную боль и разрушение.",
    "Отношения полностью основаны на зависти, ревности и соперничестве, что создает постоянный конфликт и напряжение.",
    "Один из партнеров пренебрегает своими обязанностями и обещаниями, не выполняет свои обязательства, нанося ущерб доверию другого.",
    "Партнер часто использует обиды, угрозы или шантаж, чтобы получить то, что хочет, и подавить волю и автономию другого.",
]

TECHNIQUES = [
    "Я-эмоция",
    "Я-ощущение",
    "Я-ощущение или Я-эмоция",
    "Факт",
    "Потребность",
    "Потребность или факт",
    "Потребность или я-ощущение или я-эмоция",
]

MANAGEMENT_IMPACT = [
    "Просьба",
    "Требование или приказ",
    "Закрытый вопрос",
    "Открытый вопрос",
    "Право на отказ",
]

CHANGE_SITUATION_TEXT = "Новая ситуация 😎"
WAIT_MESSAGE_TEXT = 'Хм хм хм...'

START_TEXT = '''👋 Привет! Здесь можно тренировать свои навыки отстаивать границы и потренировать декодирование.

<b>Декодирование</b> — это точная и простая фраза, которой можно заменить фразу нашего собеседника, не потеряв сути сообщения. Я буду давать фразы, а ты попробуй их декодировать.

Подробнее про декодирование можно почитать здесь:
https://skillslab.center/blogs/decoding

<b>Как тренировать личные границы:</b>

1. Я даю ситуацию и формат ответа
2. Ты пишешь свой ответ по формату
3. Я разбираю твой ответ и предлагаю свой вариант
4. Если хочешь новую ситуацию — нажми на кнопку снизу

Подробнее про границы можно почитать здесь:
https://skillslab.center/blogs/borders_practice

Начнем?
'''

CHANGE_DECODING_TEXT = "Еще декодирование 🤓"

DECODING_SITUATIONS = [
    "Я могу рассказать тебе о своих проблемах, но знаю, что тебя это не волнует.\n\n<span class='tg-spoiler'>Безразличный</span>",
    "Ты даже не обратил внимания на то, что я сделал/сказал.\n\n<span class='tg-spoiler'>Безразличный</span>",
    "Тебе все равно, что со мной происходит, правда?\n\n<span class='tg-spoiler'>Безразличный</span>",
    "Мне казалось, что мы друзья, но ты всегда проявляешь полное безразличие ко мне.\n\n<span class='tg-spoiler'>Безразличный</span>",
    "Как тебе удается быть таким безучастным к чужой боли?\n\n<span class='tg-spoiler'>Безразличный</span>",
    "Ты только мешаешь, лучше просто оставь это дело кому-то более компетентному.\n\n<span class='tg-spoiler'>Бесполезный</span>",
    "Тебе все равно не помочь, ты ничего не сможешь сделать правильно.\n\n<span class='tg-spoiler'>Бесполезный</span>",
    "Твое присутствие здесь абсолютно бесполезно, ты ничего не приносишь полезного.\n\n<span class='tg-spoiler'>Бесполезный</span>",
    "Не стоит даже пытаться, ты всегда будешь проваливаться и ничего не достигнешь.\n\n<span class='tg-spoiler'>Бесполезный</span>",
    "Зачем ты вообще что-то делаешь? Твои усилия бесполезны и никому не нужны.\n\n<span class='tg-spoiler'>Бесполезный</span>",
    "Я думал, у тебя есть хоть капля сострадания, но ошибся.\n\n<span class='tg-spoiler'>Бессердечный</span>",
    "Ты способен причинить боль кому угодно, лишь бы достичь своих целей.\n\n<span class='tg-spoiler'>Бессердечный</span>",
    "Тебе вообще не интересно, как это повлияет на других людей?\n\n<span class='tg-spoiler'>Бессердечный</span>",
    "Твое отсутствие эмпатии и чувства ответственности поражает меня.\n\n<span class='tg-spoiler'>Бессердечный</span>",
    "Неужели тебе совсем безразлично, что происходит с окружающими?\n\n<span class='tg-spoiler'>Бессердечный</span>",
    "Я просто не могу понять, как ты можешь спать спокойно, зная, что ты нанес кому-то столько вреда.\n\n<span class='tg-spoiler'>Бессовестный</span>",
    "Ты лишен элементарной этики и морали, если считаешь, что такое поведение приемлемо.\n\n<span class='tg-spoiler'>Бессовестный</span>",
    "Ты действительно не испытываешь никаких угрызений совести после того, что сделал?\n\n<span class='tg-spoiler'>Бессовестный</span>",
    "Твои поступки говорят о том, что тебе абсолютно все равно на последствия для других людей.\n\n<span class='tg-spoiler'>Бессовестный</span>",
    "Как можно быть таким бездушным и равнодушным к чужой боли?\n\n<span class='tg-spoiler'>Бессовестный</span>",
    "Ты словно губка, впитывающая все, что тебе говорят.\n\n<span class='tg-spoiler'>Внушаемый</span>",
    "Ты даже не задумываешься о своих собственных желаниях и потребностях.\n\n<span class='tg-spoiler'>Внушаемый</span>",
    "Ты всегда так легко поддаешься чужому мнению?\n\n<span class='tg-spoiler'>Внушаемый</span>",
    "Почему ты не можешь принимать самостоятельные решения?\n\n<span class='tg-spoiler'>Внушаемый</span>",
    "Неужели тебе нужно, чтобы кто-то другой решал за тебя?\n\n<span class='tg-spoiler'>Внушаемый</span>",
    "Я уже не удивляюсь твоей глупости. Ты всегда делаешь самые нелепые ошибки.\n\n<span class='tg-spoiler'>Глупый</span>",
    "Ты опять не понял простейшую инструкцию? Неужели тебе так сложно усвоить элементарные вещи?\n\n<span class='tg-spoiler'>Глупый</span>",
    "Ты действительно считаешь, что такое решение имеет какой-то смысл? Это же полная глупость!\n\n<span class='tg-spoiler'>Глупый</span>",
    "Не знаю, как ты мог так глупо поступить. Любой разумный человек бы понял, что это неправильное решение.\n\n<span class='tg-spoiler'>Глупый</span>",
    "Как можно быть таким глупым, чтобы поверить в такую очевидную ложь?\n\n<span class='tg-spoiler'>Глупый</span>",
    "Я не верю ни одному слову из того, что ты говоришь, потому что ты всегда играешь роль двуличного человека.\n\n<span class='tg-spoiler'>Двуличный</span>",
    "Ты постоянно меняешь свою точку зрения в зависимости от обстоятельств. Это очень двулично.\n\n<span class='tg-spoiler'>Двуличный</span>",
    "Ты всегда такой добрый и улыбчивый, а за спиной говоришь совсем другое.\n\n<span class='tg-spoiler'>Двуличный</span>",
    "Не могу понять, как можно быть одновременно столь хитрым и лживым.\n\n<span class='tg-spoiler'>Двуличный</span>",
    "Как ты можешь быть таким двуличным? Вчера обещал помочь, а сегодня просто проигнорировал.\n\n<span class='tg-spoiler'>Двуличный</span>",
    "Я устал быть твоим спасителем. Найди другой способ решить свои проблемы.\n\n<span class='tg-spoiler'>Зависишь</span>",
    "Ты всегда на кого-то полагаешься, а сам ничего не можешь сделать?\n\n<span class='tg-spoiler'>Зависишь</span>",
    "Постоянно приходится за тебя платить и делать все работу. Когда ты уже научишься быть самостоятельным?\n\n<span class='tg-spoiler'>Зависишь</span>",
    "Неужели ты думаешь, что кто-то будет тебя поддерживать всю жизнь? Пора взять ответственность на себя.\n\n<span class='tg-spoiler'>Зависишь</span>",
    "Как ты собираешься выжить без моей помощи? Тебе явно не хватает навыков и ресурсов.\n\n<span class='tg-spoiler'>Зависишь</span>",
    "Так, а тебе опять не хватает новых вещей? Ну да, конечно, только у тебя всегда все должно быть самое лучшее и самое дорогое.\n\n<span class='tg-spoiler'>Избалованная</span>",
    "Ого, еще одна капризная просьба от избалованной особы! Когда же ты научишься ценить то, что уже есть?\n\n<span class='tg-spoiler'>Избалованная</span>",
    "Ничего не удивляет, что ты снова недовольна. Всегда нужно, чтобы все было именно так, как ты хочешь.\n\n<span class='tg-spoiler'>Избалованная</span>",
    "Неужели ты снова требуешь, чтобы все делали по-твоему? Ты привыкла, что все должны подстраиваться под тебя?\n\n<span class='tg-spoiler'>Избалованная</span>",
    "Ах, эта избалованная принцесса снова начинает свою панику. Постоянно требуешь особого внимания и заботы.\n\n<span class='tg-spoiler'>Избалованная</span>",
    "Тебе уже сколько лет, а все еще не можешь самостоятельно принимать решения?\n\n<span class='tg-spoiler'>Инфантильный</span>",
    "Почему ты всегда ожидаешь, что кто-то будет делать все за тебя?\n\n<span class='tg-spoiler'>Инфантильный</span>",
    "Неужели ты думаешь, что мир вращается вокруг тебя и все должны удовлетворять твои потребности?\n\n<span class='tg-spoiler'>Инфантильный</span>",
    "Когда же ты наконец вырастешь и начнешь брать ответственность за свою жизнь?\n\n<span class='tg-spoiler'>Инфантильный</span>",
    "Взрослые люди справляются с такими проблемами без постоянной помощи.\n\n<span class='tg-spoiler'>Инфантильный</span>",
    "Ты постоянно меняешь свои планы и цели, словно они не имеют для тебя никакого значения.\n\n<span class='tg-spoiler'>Легкомысленный</span>",
    "Ты всегда принимаешь решения наспех, не задумываясь о последствиях?\n\n<span class='tg-spoiler'>Легкомысленный</span>",
    "Тебе кажется, что жизнь это одна большая игра, где можно делать все, что хочется?\n\n<span class='tg-spoiler'>Легкомысленный</span>",
    "Почему ты так легко отказываешься от своих обязательств и обещаний?\n\n<span class='tg-spoiler'>Легкомысленный</span>",
    "Неужели тебя никогда не беспокоят возможные опасности или проблемы, которые могут возникнуть из-за твоего безответственного поведения?\n\n<span class='tg-spoiler'>Легкомысленный</span>",
    "Ты такой ленивый, что даже самые простые задачи становятся для тебя непосильными.\n\n<span class='tg-spoiler'>Ленивый</span>",
    "Так тебе и ничего не нужно делать? Всегда находишь оправдания, чтобы откладывать работу.\n\n<span class='tg-spoiler'>Ленивый</span>",
    "Почему всегда все задания выполняются за тебя? Ты даже не пытаешься взять на себя ответственность.\n\n<span class='tg-spoiler'>Ленивый</span>",
    "Неужели тебе так сложно подняться с кровати и начать заниматься делами? Лень убивает твою продуктивность.\n\n<span class='tg-spoiler'>Ленивый</span>",
    "Вместо того, чтобы помочь, ты просто лежишь на диване и ничего не делаешь. Когда это закончится?\n\n<span class='tg-spoiler'>Ленивый</span>",
    "Я видел, как ты обсуждал меня за спиной со своими друзьями, а потом приходил и улыбался мне в лицо.\n\n<span class='tg-spoiler'>Лицемерный</span>",
    "Ты постоянно говоришь одно, а делаешь совсем другое. Твои слова и поступки противоречат друг другу.\n\n<span class='tg-spoiler'>Лицемерный</span>",
    "Ты всегда такой добрый и отзывчивый, а как только тебе что-то не нравится, сразу меняешь свое отношение ко мне.\n\n<span class='tg-spoiler'>Лицемерный</span>",
    "Ты всегда стараешься показать себя лучше, чем есть на самом деле, но я знаю, что под этой маской скрывается лицемерие.\n\n<span class='tg-spoiler'>Лицемерный</span>",
    "Как же удобно быть лицемерным и улыбаться в лицо, когда на самом деле испытываешь к человеку неприязнь.\n\n<span class='tg-spoiler'>Лицемерный</span>",
    "Ты так занят проверкой каждой моей фразы, что упускаешь главное содержание идеи, которую я пытаюсь передать.\n\n<span class='tg-spoiler'>Мелочный</span>",
    "Ты всегда находишь повод упомянуть мою маленькую ошибку, но не замечаешь своих собственных серьезных промахов.\n\n<span class='tg-spoiler'>Мелочный</span>",
    "Твоя постоянная критика моего стиля одежды или выбора ресторана показывает, что ты слишком зациклен на мелочах.\n\n<span class='tg-spoiler'>Мелочный</span>",
    "Постоянно придираться к мелочам только отталкивает людей от тебя и создает напряжение в отношениях.\n\n<span class='tg-spoiler'>Мелочный</span>",
    "Вместо того, чтобы обсуждать важные вопросы, ты застреваешь в деталях и делаешь из мухи слона.\n\n<span class='tg-spoiler'>Мелочный</span>",
    "Я не ожидал(а), что ты окажешься таким(ой) жадным(ой).\n\n<span class='tg-spoiler'>Меркантильный</span>",
    "Ты всегда ставишь свои интересы выше всех остальных.\n\n<span class='tg-spoiler'>Меркантильный</span>",
    "Твоя жаждa наживы просто отталкивает меня.\n\n<span class='tg-spoiler'>Меркантильный</span>",
    "Так что, тебе деньги важнее, чем наша дружба?\n\n<span class='tg-spoiler'>Меркантильный</span>",
    "Когда речь заходит о деньгах, ты готов(а) пойти на любые уловки и манипуляции.\n\n<span class='tg-spoiler'>Меркантильный</span>",
    "Ты переживаешь из-за каждой мелочи и создаешь проблемы там, где их на самом деле нет. Расслабься и не бери все так близко к сердцу.\n\n<span class='tg-spoiler'>Мнительный</span>",
    "Ты всегда видишь заговоры и подозреваешь, что все против тебя?\n\n<span class='tg-spoiler'>Мнительный</span>",
    "Почему ты так недоверчиво относишься ко всем моим предложениям? Ты постоянно ищешь скрытые подвохи.\n\n<span class='tg-spoiler'>Мнительный</span>",
    "Неужели каждый раз, когда я опаздываю, ты сразу думаешь, что я специально задерживаюсь?\n\n<span class='tg-spoiler'>Мнительный</span>",
    "Даже если я говорю правду, ты все равно сомневаешься в моих словах. Почему ты так параноидален?\n\n<span class='tg-spoiler'>Мнительный</span>",
    "Ты думал, что уйдешь от ответственности? Не так быстро. Я найду тебя и покажу, что значит быть мстительным.\n\n<span class='tg-spoiler'>Мстительный</span>",
    "Так что, теперь ты думаешь, что можешь со мной делать все, что хочешь? Подожди, я найду способ отомстить.\n\n<span class='tg-spoiler'>Мстительный</span>",
    "Помнишь, как ты меня предал? Я не забуду этого и сделаю все, чтобы вернуться за тобой.\n\n<span class='tg-spoiler'>Мстительный</span>",
    "Не забывай, что я никогда не прощаю обиды. Ты лучше будь готов к последствиям своих действий.\n\n<span class='tg-spoiler'>Мстительный</span>",
    "Каждое действие имеет последствия, а твои действия вызвали во мне желание отомстить. Будь готов столкнуться с ними.\n\n<span class='tg-spoiler'>Мстительный</span>",
    "Ты так наивно полагаешься на других, что часто становишься жертвой их манипуляций.\n\n<span class='tg-spoiler'>Наивный</span>",
    "Ты всегда веришь во все сказки и обещания, даже если они звучат слишком хорошо, чтобы быть правдой.\n\n<span class='tg-spoiler'>Наивный</span>",
    "Тебя легко обмануть, потому что ты не видишь скрытых мотивов людей.\n\n<span class='tg-spoiler'>Наивный</span>",
    "Почему ты всегда думаешь, что у всех людей есть только хорошие намерения?\n\n<span class='tg-spoiler'>Наивный</span>",
    "Неужели ты думаешь, что эта компания на самом деле заботится о своих сотрудниках?\n\n<span class='tg-spoiler'>Наивный</span>",
    "Я разочарован в тебе до такой степени, что сомневаюсь, стоит ли продолжать наше общение.\n\n<span class='tg-spoiler'>Не достоин</span>",
    "Ты такой непоследовательный, что даже не заслуживаешь моего времени и внимания.\n\n<span class='tg-spoiler'>Не достоин</span>",
    "Ты так легко изменяешь своим принципам, что я не могу больше доверять тебе.\n\n<span class='tg-spoiler'>Не достоин</span>",
    "Ты не достоин моей дружбы, потому что всегда оказываешься наиболее выгодной стороной для себя.\n\n<span class='tg-spoiler'>Не достоин</span>",
    "Твое поведение показывает, что ты неспособен к самостоятельности и ответственности.\n\n<span class='tg-spoiler'>Не достоин</span>",
    "Я думал, что ты будешь намного лучше в этом.\n\n<span class='tg-spoiler'>Не оправдал ожиданий</span>",
    "Ты не справился с задачей, как я ожидал.\n\n<span class='tg-spoiler'>Не оправдал ожиданий</span>",
    "Ты меня очень разочаровал своими результатами.\n\n<span class='tg-spoiler'>Не оправдал ожиданий</span>",
    "Такое разочарование, я ожидал от тебя большего.\n\n<span class='tg-spoiler'>Не оправдал ожиданий</span>",
    "Мне казалось, что ты можешь сделать это гораздо лучше.\n\n<span class='tg-spoiler'>Не оправдал ожиданий</span>",
    "Я всегда помогал тебе, а теперь, когда у меня нужна поддержка, ты просто отвернулся.\n\n<span class='tg-spoiler'>Неблагодарный</span>",
    "Ты забыл все мои добрые дела и сразу же обратил внимание только на одну ошибку.\n\n<span class='tg-spoiler'>Неблагодарный</span>",
    "Ты всегда требуешь больше и больше, но никогда не ценишь то, что уже получил.\n\n<span class='tg-spoiler'>Неблагодарный</span>",
    "После всего, что я для тебя сделал, ты не проявляешь никакой благодарности.\n\n<span class='tg-spoiler'>Неблагодарный</span>",
    "Каждый раз, когда я тебе помогаю, ты принимаешь это как должное, не задумываясь о том, сколько усилий я приложил.\n\n<span class='tg-spoiler'>Неблагодарный</span>",
    "Я рассказывал тебе об этом проекте на прошлой неделе, а ты сейчас спрашиваешь, о чём речь?\n\n<span class='tg-spoiler'>Невнимательный</span>",
    "Ты снова потерял ключи от квартиры? Как можно быть таким невнимательным и неорганизованным?\n\n<span class='tg-spoiler'>Невнимательный</span>",
    "Ты опять не прочитал моё сообщение до конца? Я уже три раза повторял, что нужно сделать!\n\n<span class='tg-spoiler'>Невнимательный</span>",
    "Почему ты всегда забываешь важные детали? Это уже стало постоянной проблемой!\n\n<span class='tg-spoiler'>Невнимательный</span>",
    "Неужели так сложно запомнить, что у меня аллергия на орехи? Ты каждый раз предлагаешь мне блюдо с орехами!\n\n<span class='tg-spoiler'>Невнимательный</span>",
    "Я думал, что люди уже выросли из этого, а ты все еще проявляешь свою невоспитанность.\n\n<span class='tg-spoiler'>Невоспитанный</span>",
    "Тебе никто не научился, что такое элементарные правила приличия?\n\n<span class='tg-spoiler'>Невоспитанный</span>",
    "Твоя безграмотность и неприятное общение только подтверждают, что ты невоспитанный человек.\n\n<span class='tg-spoiler'>Невоспитанный</span>",
    "Такое поведение говорит о том, что ты совершенно неуважительно относишься к окружающим.\n\n<span class='tg-spoiler'>Невоспитанный</span>",
    "Неужели твои родители никогда не учили тебя быть вежливым?\n\n<span class='tg-spoiler'>Невоспитанный</span>",
    "Ты слишком сосредоточен на мгновенном удовольствии и не видишь, как это может повлиять на твое будущее.\n\n<span class='tg-spoiler'>Недальновидный</span>",
    "Ты действительно думаешь, что это решение принесет тебе успех в будущем?\n\n<span class='tg-spoiler'>Недальновидный</span>",
    "Твоя недальновидность только мешает тебе достичь больших результатов.\n\n<span class='tg-spoiler'>Недальновидный</span>",
    "Неужели ты не видишь, какие возможности упускаешь из-за своей краткосрочной мысли?\n\n<span class='tg-spoiler'>Недальновидный</span>",
    "Если бы ты задумался о последствиях своих действий, то понял бы, что это не самый лучший выбор.\n\n<span class='tg-spoiler'>Недальновидный</span>",
    "Я бы посоветовал тебе обратиться за помощью к более опытным коллегам. Ты ведь не очень разбираешься в этом вопросе.\n\n<span class='tg-spoiler'>Некомпетентный</span>",
    "Ты уверен, что справишься с этой задачей? Мне кажется, тебе может не хватить знаний и опыта.\n\n<span class='tg-spoiler'>Некомпетентный</span>",
    "Ты такой некомпетентный, что даже не понимаю, как ты до сих пор работаешь здесь.\n\n<span class='tg-spoiler'>Некомпетентный</span>",
    "Не стоит тратить время на то, чтобы пытаться разобраться самому. Лучше просто спроси у меня, я уже все изучил.\n\n<span class='tg-spoiler'>Некомпетентный</span>",
    "Может быть, лучше дай мне это дело, я точно справлюсь. У тебя все равно ничего не получится.\n\n<span class='tg-spoiler'>Некомпетентный</span>",
    "Ты уже не первый раз обещаешь помочь, а потом пропадаешь без следа.\n\n<span class='tg-spoiler'>Ненадежный</span>",
    "Твои обещания пустые слова, никогда не выполняешь то, что говоришь.\n\n<span class='tg-spoiler'>Ненадежный</span>",
    "Не могу положиться на тебя в критической ситуации, всегда что-то идет не так.\n\n<span class='tg-spoiler'>Ненадежный</span>",
    "Лучше не рассчитывать на тебя, ты всегда подводишь в самый ответственный момент.\n\n<span class='tg-spoiler'>Ненадежный</span>",
    "Каждый раз, когда нужно что-то сделать, ты находишь отговорки и уклоняешься.\n\n<span class='tg-spoiler'>Ненадежный</span>",
    "Я и без тебя справлюсь, не надо свою помощь навязывать.\n\n<span class='tg-spoiler'>Ненужный</span>",
    "Ты только мешаешь, лучше уйди и займись чем-то другим.\n\n<span class='tg-spoiler'>Ненужный</span>",
    "Тебе все равно не нужны мои советы, так что зачем тебя слушать?\n\n<span class='tg-spoiler'>Ненужный</span>",
    "Твое мнение никому не интересно, так что лучше промолчи.\n\n<span class='tg-spoiler'>Ненужный</span>",
    "Не стоит даже пытаться включаться в нашу команду, мы и так обойдемся без тебя.\n\n<span class='tg-spoiler'>Ненужный</span>",
    "Я бы на твоем месте лучше обратился к более опытным специалистам.\n\n<span class='tg-spoiler'>Неопытный</span>",
    "Тебе, конечно, виднее, но мне кажется, что с таким опытом ты не справишься.\n\n<span class='tg-spoiler'>Неопытный</span>",
    "Судя по тому, что ты делаешь, сложно поверить, что у тебя есть хоть какой-то опыт.\n\n<span class='tg-spoiler'>Неопытный</span>",
    "Ну какой опыт у тебя может быть в этом деле? Ты только начал разбираться.\n\n<span class='tg-spoiler'>Неопытный</span>",
    "Может быть, стоит позвать кого-то более опытного, чтобы помочь тебе с этим заданием?\n\n<span class='tg-spoiler'>Неопытный</span>",
    "Ты такой зависимый от других, что уже не представляю, как бы ты справился без них.\n\n<span class='tg-spoiler'>Несамостоятельный</span>",
    "Так тебе и нужно, всегда полагаться на других и ничего самому не делать.\n\n<span class='tg-spoiler'>Несамостоятельный</span>",
    "Почему ты всегда ждешь, чтобы кто-то другой принял решение? Неужели у тебя нет своего мнения?\n\n<span class='tg-spoiler'>Несамостоятельный</span>",
    "Неужели ты думаешь, что кто-то будет за тебя решать все проблемы?\n\n<span class='tg-spoiler'>Несамостоятельный</span>",
    "Вот видишь, опять приходится тебе помогать, потому что сам справиться не можешь.\n\n<span class='tg-spoiler'>Несамостоятельный</span>",
    "Ты постоянно используешь двойные стандарты, требуя от других больше, чем сам готов отдать.\n\n<span class='tg-spoiler'>Несправедливый</span>",
    "Ты даже не задумываешься о чужих интересах, лишь бы удовлетворить свои желания.\n\n<span class='tg-spoiler'>Несправедливый</span>",
    "Так, значит, тебе не нужно делать никакую работу, а остальным придется все сами делать?\n\n<span class='tg-spoiler'>Несправедливый</span>",
    "Почему всегда только ты получаешь лучшие условия и привилегии?\n\n<span class='tg-spoiler'>Несправедливый</span>",
    "Когда речь идет о распределении ответственности, ты всегда находишь способ переложить ее на других.\n\n<span class='tg-spoiler'>Несправедливый</span>",
    "Я думал, что можем доверять друг другу, а оказывается ты просто обманщик.\n\n<span class='tg-spoiler'>Обманщик</span>",
    "Ты всегда такой честный и надежный, а вот сейчас тебе удобно обмануть меня?\n\n<span class='tg-spoiler'>Обманщик</span>",
    "Твои слова и поступки не соответствуют друг другу - это признак настоящего обманщика.\n\n<span class='tg-spoiler'>Обманщик</span>",
    "Неужели тебе так сложно быть откровенным? Всегда нужно играть роль обманщика?\n\n<span class='tg-spoiler'>Обманщик</span>",
    "Как можно верить человеку, который постоянно обманывает своих близких?\n\n<span class='tg-spoiler'>Обманщик</span>",
    "Я постоянно тебя таскаю на себе, а ты даже пальцем не шевелишь!\n\n<span class='tg-spoiler'>Обуза</span>",
    "Ты такая обуза, что даже не представляешь, какую нагрузку ты на меня возлагаешь.\n\n<span class='tg-spoiler'>Обуза</span>",
    "Ты всегда только проблемы создаешь, никогда не помогаешь!\n\n<span class='tg-spoiler'>Обуза</span>",
    "Твое присутствие всегда вызывает лишние хлопот и заботы.\n\n<span class='tg-spoiler'>Обуза</span>",
    "Как всегда, мне приходится решать все проблемы, связанные с тобой.\n\n<span class='tg-spoiler'>Обуза</span>",
    "Я думал, что можем полностью доверять друг другу, но видимо ошибался.\n\n<span class='tg-spoiler'>Предатель</span>",
    "Ты знаешь, что предательство - это одно из самых низких поступков, верно?\n\n<span class='tg-spoiler'>Предатель</span>",
    "Ты всегда говорил, что мы команда, а теперь вот такой оборот событий...\n\n<span class='tg-spoiler'>Предатель</span>",
    "Никогда не ожидал от тебя такого предательства, разочарование просто огромное.\n\n<span class='tg-spoiler'>Предатель</span>",
    "Как можно было нас так подставить и продать своих друзей?\n\n<span class='tg-spoiler'>Предатель</span>",
    "Ты сразу предполагаешь, что я виноват, не слушая мою сторону истории.\n\n<span class='tg-spoiler'>Предвзятый</span>",
    "Ты отказываешься прислушиваться к моим аргументам, потому что уже заранее решил, что ты прав.\n\n<span class='tg-spoiler'>Предвзятый</span>",
    "Ты никогда не даешь мне шанса проявить свои способности, потому что считаешь, что я неспособен.\n\n<span class='tg-spoiler'>Предвзятый</span>",
    "Ты всегда находишь повод критиковать меня, даже если я делаю все правильно.\n\n<span class='tg-spoiler'>Предвзятый</span>",
    "Ты всегда выбираешь сторону других людей, даже если они не правы, только потому что тебе с ними ближе.\n\n<span class='tg-spoiler'>Предвзятый</span>",
    "Ты всегда находишь повод придраться ко мне!\n\n<span class='tg-spoiler'>Придираешься</span>",
    "Придирки и замечания - это все, что у тебя есть?\n\n<span class='tg-spoiler'>Придираешься</span>",
    "Неужели тебе так сложно просто принять, что я делаю?\n\n<span class='tg-spoiler'>Придираешься</span>",
    "Может хватит уже придираться к каждой мелочи?\n\n<span class='tg-spoiler'>Придираешься</span>",
    "Всегда найдешь, чему придираться!\n\n<span class='tg-spoiler'>Придираешься</span>",
    "Ты всегда находишь способ похвалить только себя, даже когда это неуместно.\n\n<span class='tg-spoiler'>Самовлюбленный</span>",
    "Ты все время говоришь о своих достижениях и успехах, но не проявляешь интереса к жизни других людей.\n\n<span class='tg-spoiler'>Самовлюбленный</span>",
    "Твоя самовлюбленность мешает тебе видеть и понимать чужие потребности и проблемы.\n\n<span class='tg-spoiler'>Самовлюбленный</span>",
    "Твоя самовлюбленность делает тебя эгоистичным и неспособным к сотрудничеству с другими.\n\n<span class='tg-spoiler'>Самовлюбленный</span>",
    "Как ты можешь быть таким самовлюбленным, что даже не замечаешь других людей вокруг?\n\n<span class='tg-spoiler'>Самовлюбленный</span>",
    "Я всегда достигаю своих целей без помощи других людей, так что не стоит предлагать свою помощь.\n\n<span class='tg-spoiler'>Самоуверенный</span>",
    "Я бы посмотрел на твои результаты, прежде чем делать какие-либо выводы о моей работе.\n\n<span class='tg-spoiler'>Самоуверенный</span>",
    "Тебе, конечно, легко судить о моих действиях, когда у тебя самого нет никакого опыта в этой области.\n\n<span class='tg-spoiler'>Самоуверенный</span>",
    "Не нужно пытаться меня учить, я знаю, что делаю и мне не нужны твои советы.\n\n<span class='tg-spoiler'>Самоуверенный</span>",
    "Можешь продолжать сомневаться в моих способностях, но это только подтверждает твою зависть и непонимание.\n\n<span class='tg-spoiler'>Самоуверенный</span>",
    "Я думал, ты уже вырос и научился решать свои проблемы самостоятельно.\n\n<span class='tg-spoiler'>Слабый</span>",
    "Ты никогда не сможешь достичь успеха, если продолжишь быть таким слабым.\n\n<span class='tg-spoiler'>Слабый</span>",
    "Тебе опять не удалось справиться с этой простой задачей?\n\n<span class='tg-spoiler'>Слабый</span>",
    "Неужели ты так и будешь всю жизнь полагаться на других?\n\n<span class='tg-spoiler'>Слабый</span>",
    "Всегда нужно за тобой убирать и исправлять твои ошибки.\n\n<span class='tg-spoiler'>Слабый</span>",
    "Так тебе идти на собеседование? Ну, если только не боишься провалиться как в прошлый раз.\n\n<span class='tg-spoiler'>Трусливый</span>",
    "Опять отменил поездку из-за непогоды? Ты такой трусливый, что даже немного дождика испугался.\n\n<span class='tg-spoiler'>Трусливый</span>",
    "Неужели опять отказываешься пойти на вечеринку? Видимо, страх перед новыми знакомствами переборол тебя.\n\n<span class='tg-spoiler'>Трусливый</span>",
    "Всегда легче скрываться за спиной других, правда? Ты такой трусливый, что даже не можешь выступить самостоятельно.\n\n<span class='tg-spoiler'>Трусливый</span>",
    "А что, ты даже не попытался защитить свою точку зрения? Кажется, ты просто боишься конфликтов.\n\n<span class='tg-spoiler'>Трусливый</span>",
    "Я просто боюсь, что ты можешь попасть в неприятную ситуацию из-за этого.\n\n<span class='tg-spoiler'>Ты для меня риск</span>",
    "Ты уверен, что стоит рисковать своей карьерой ради этого проекта?\n\n<span class='tg-spoiler'>Ты для меня риск</span>",
    "Размышляй хорошенько, ведь это может повлиять на твою будущность.\n\n<span class='tg-spoiler'>Ты для меня риск</span>",
    "Неужели тебе не жалко потерять все, чем мы с тобой долго работали?\n\n<span class='tg-spoiler'>Ты для меня риск</span>",
    "Может быть, лучше подумать о безопасных альтернативах?\n\n<span class='tg-spoiler'>Ты для меня риск</span>",
    "Я думал, ты меня знаешь лучше, но видимо, я ошибался.\n\n<span class='tg-spoiler'>Чужой</span>",
    "Ты так и не понял, что значит быть командой, а не играть только на своей стороне.\n\n<span class='tg-spoiler'>Чужой</span>",
    "Ты ведь никогда не сможешь понять, что это значит быть настоящим другом.\n\n<span class='tg-spoiler'>Чужой</span>",
    "Тебе всегда было все равно, как мне будет после этого.\n\n<span class='tg-spoiler'>Чужой</span>",
    "Как можно быть таким безразличным к чужим проблемам?\n\n<span class='tg-spoiler'>Чужой</span>",
    "Тебе никогда не важно, как это повлияет на других людей.\n\n<span class='tg-spoiler'>Эгоист</span>",
    "Никогда не проявляешь сопереживания или сострадания к другим.\n\n<span class='tg-spoiler'>Эгоист</span>",
    "Не замечаешь нужд и проблем окружающих, пока они не касаются тебя лично.\n\n<span class='tg-spoiler'>Эгоист</span>",
    "Готов использовать людей ради достижения своих целей.\n\n<span class='tg-spoiler'>Эгоист</span>",
    "Всегда думаешь только о своих интересах и комфорте.\n\n<span class='tg-spoiler'>Эгоист</span>",
    "Я видел, как ты предательски обращался с другими людьми, поэтому у меня нет оснований доверять тебе.\n\n<span class='tg-spoiler'>Я тебе не доверяю</span>",
    "Ты уже неоднократно проявил свою недобросовестность, поэтому я не могу рисковать и доверять тебе.\n\n<span class='tg-spoiler'>Я тебе не доверяю</span>",
    "Ты всегда находишь способы обмануть меня, поэтому я не могу тебе доверять.\n\n<span class='tg-spoiler'>Я тебе не доверяю</span>",
    "Твои поступки и ложные обещания показывают, что я не могу доверять тебе ни в чем.\n\n<span class='tg-spoiler'>Я тебе не доверяю</span>",
    "Каждый раз, когда я полагаюсь на тебя, ты подводишь меня. Поэтому я больше не верю тебе.\n\n<span class='tg-spoiler'>Я тебе не доверяю</span>",
]

USERS_INFO = {}
