SYSTEM_SONTEXT = """
Каждый из нас видит окружающий мир через призму своих суждений.

Когда мы говорим через ты-сообщения, мы приписываем другому человеку чувства, мысли, действия. Часто это также звучит как обвинение.

Например, «ты меня обидел». В ответ вы можете получить долгую дискуссию о том, почему вам все показалось, и что никто вас не обижал.

Если же сказать «мне обидно, когда меня перебивают», подобная дискуссия вряд ли возникнет. «Мне обидно» — это я-сообщение, где мы подчеркиваем, что это наше личное ощущение или мнение.

В Я-сообщении может быть:

Я-эмоция («мне обидно» вместо «ты меня обидел»)
Я-ощущение («У меня возникает ощущение») + суждение («что мою работу не ценят»)

Защита границ без фактов — мнение. Любое мнение субъективно. Если человек решит, что его обвиняют, он начнет спорить про объективность вашего мнения.

Когда называем конкретные (объективные) факты, то человек меньше склонен с нами спорить.

Оценка: «Ты слишком часто опаздываешь».
Факт: «За эту неделю ты опоздал 3 раза».

Третьи и четвертым элементом являются потребность и просьба.

Потребность  — это наша необходимость. Показывая свою потребность собеседнику, мы показываем партнеру, что для нас важно и как с нами можно строить продуктивные и комфортные отношения.

Например:

Мне важно уважение/доверие/саморазвитие
Мне хочется получать заботу/любовь/поддержку
Мне важно продвижение в карьере

Просьба — последний этап защиты своих границ. Здесь мы оказываем управленческое воздействия, показывая, что конкретно мы хотим. Важно помнить, что просьбу от приказа отличает наличие права на отказ.

Например:

Можешь, пожалуйста, снимать ботинки, когда заходишь в квартиру?
Можешь, пожалуйста, давать мне обратную связь лично, а не при всех?

Данная схема построена на немного измененных идеях ненасильственного общения. Познакомиться с ним больше вы можете в книге Маршалла Розенберга «Ненасильственное общение. Язык жизни»

В схеме 4 части:


С помощью этой схемы мы можем экологично показать, что именно нас задело в словах собеседника и почему. Например, можно показать границу на работе.

Например, коллега на работе вас спрашивает: «Сколько ты зарабатываешь?»

Как можно ответить, используя эту схему:

Я-сообщение → факт → потребность → просьба.

Мне некомфортно(неприятно, страшно, неловко), когда меня спрашивают сколько я зарабатываю. Мне важна моя приватность в вопросе деньгах, можешь, пожалуйста, больше не спрашивать меня о моей зарплате/премиях?

=====

Я присылаю задачу и свое решение.

Сначала разбери мой ответ, укажи что я сделал корректно, а что нет.

Потом напиши пример ответа на задачу, при этом для каждой составляющей формулы напиши какая фраза за нее отвечает.

После разбора по частям напиши полную фразу по формуле.

Дополнительно пиши что не так в ситуации из задачи, почему она токсичная.

Используй такую струткуру ответа с заголовками:

<b>1. Комментарий по ответу:</b>
<b>2. Пример ответа по формуле:</b>
<b>3. Комментарий к ситуации:</b>

Используй html тег <b> </b> в ответе чтобы выделить заголовки и элементы формулы.

Например:

<b>1. Комментарий по ответу:</b>

Ваш ответ содержит несколько элементов формулы, но требует некоторых уточнений и дополнений. Давайте разберем его:

Я-эмоция: Ваше чувство раздражения.

Факт/потребность: В данном ответе не указан факт или потребность, которые вы хотите подчеркнуть или описать.

Я-эмоция: Ваше предложение заканчивается вопросом, поэтому можно сказать, что второе "Я-эмоция" присутствует.

Право на отказ/эмоцию/границу: В вашем ответе не присутствует явное указание на право на отказ, эмоцию или границу.

<b>2. Пример ответа по формуле:</b>

Я-эмоция:

Факт/потребность:

Я-эмоция:

Возможный вариант ответа с учетом этих дополнений:

<b>3. Комментарий к ситуации:</b>

Ситуация, описанная в данном случае, может быть токсичной по нескольким причинам:

"""

SITUATIONS = [
    # Работа
    "Руководитель отказывается выслушать мнение сотрудника, прерывая его и грубо перебивая.",
    "Коллега упрекает другого в неэффективности работы перед всей командой, нарушая его самолюбие.",
    "Сотрудник активно распространяет сплетни и слухи о своих коллегах, нанося ущерб их репутации.",
    "Начальник выдает новое задание в последний момент, зная, что сотрудник не успеет выполнить его в срок, и подчеркивает его неспособность.",
    "Работник игнорирует мнения и идеи других членов команды, отмахиваясь от них и не учитывая их вклад.",
    "Коллега постоянно критикует внешний вид другого сотрудника, подшучивая и оскорбляя его.",
    "Руководитель отказывается давать обратную связь и конструктивную критику, используя только негативные комментарии и унизительные высказывания.",
    "Сотрудник занимает персональное пространство другого, нарушая его границы и не уважая личные границы.",
    "Начальник демонстрирует предвзятость, давая преимущество определенным сотрудникам, игнорируя других и создавая конфликт интересов.",
    "Коллега присваивает заслуги и достижения других людей, утаивая их вклад и представляя его как свой.",
    "Руководитель принимает решения без консультации с командой, игнорируя их мнения и опыт.",
    "Сотрудник намеренно подавляет и мешает развитию других коллег, чтобы сохранить свое доминирующее положение.",
    "Коллега подшучивает над слабостями и недостатками другого сотрудника, вызывая у него стыд и дискомфорт.",
    "Начальник дает нереалистичные и невыполнимые задачи, зная, что это вызовет стресс и неудовлетворение у сотрудников.",
    "Работник перебивает и прерывает презентацию другого, не уделяя ему должного внимания и проявляя неуважение.",
    "Сотрудник часто отменяет и переносит запланированные встречи и совещания без предупреждения, нарушая рабочий график других людей.",
    "Коллега находит способы скрытого манипулирования и контроля над другими сотрудниками, ограничивая их свободу и независимость.",
    "Начальник угрожает увольнением или иными негативными последствиями, чтобы подавить мнение и противоречия сотрудников.",
    "Работник отказывается делиться информацией и ресурсами со своими коллегами, ставя их в неравные условия.",
    "Сотрудник намеренно игнорирует и пренебрегает инструкциями и правилами, создавая хаос и проблемы для остальных.",

    # Родители
    "Родитель постоянно вмешивается в личную жизнь своего ребенка, давая непрошенные советы и указания.",
    "Родитель критикует и оспаривает решения своего ребенка, недоверяя его способностям и опыту.",
    "Дети сравнивают своих родителей с другими людьми, намекая на их неудачи или недостатки.",
    "Родитель контролирует финансовые решения своего ребенка, не давая ему независимости в управлении своими финансами.",
    "Родитель навязывает свое мнение и ставит свои желания выше интересов и желаний своего ребенка.",
    "Родитель постоянно критикует внешность и стиль одежды своего ребенка, вызывая у него комплексы и неуверенность.",
    "Дети отказываются принимать ответственность за свои действия, сваливая все проблемы и ошибки на родителей.",
    "Родитель слишком строго контролирует время и расписание своего ребенка, не давая ему свободы и самостоятельности.",
    "Родитель вмешивается в профессиональную жизнь своего ребенка, диктуя ему, какую карьеру выбрать или какие решения принимать.",
    "Родитель негативно высказывается о друзьях или партнерах своего ребенка, пытаясь разрушить их отношения или доверие.",

    # Отношения
    "Партнер постоянно критикует и унижает другого, подрывая его самооценку и уверенность.",
    "В отношениях доминирует одна сторона, принимая все решения и не учитывая мнение и желания другого.",
    "Партнер контролирует все действия и перемещения другого, ограничивая его свободу и независимость.",
    "Один из партнеров злоупотребляет алкоголем или наркотиками, что негативно сказывается на отношениях.",
    "Партнер игнорирует эмоциональные или физические границы другого, нарушая его личное пространство и комфорт.",
    "В отношениях присутствует эмоциональное или физическое насилие, что создает токсичную и опасную среду.",
    "Партнер систематически изменяет другому, нарушая доверие и вызывая эмоциональную боль и разрушение.",
    "Отношения полностью основаны на зависти, ревности и соперничестве, что создает постоянный конфликт и напряжение.",
    "Один из партнеров пренебрегает своими обязанностями и обещаниями, не выполняет свои обязательства, нанося ущерб доверию другого.",
    "Партнер часто использует обиды, угрозы или шантаж, чтобы получить то, что хочет, и подавить волю и автономию другого.",
]

TECHNIQUES = [
    "Я-эмоция",
    "Я-ощущение",
    "Я-ощущение или Я-эмоция",
    "Факт",
    "Потребность",
    "Потребность или факт",
    "Потребность или я-ощущение или я-эмоция",
]

MANAGEMENT_IMPACT = [
    "Просьба",
    "Требование или приказ",
    "Закрытый вопрос",
    "Открытый вопрос",
    "Право на отказ",
]

CHANGE_SITUATION_TEXT = "Новая ситуация 😎"
WAIT_MESSAGE_TEXT = 'Хм хм хм...'

START_TEXT = '''👋 Привет! Здесь можно тренировать свои навыки отстаивать границы.

1. Я даю ситуацию и формат ответа
2. Ты пишешь свой ответ по формату
3. Я разбираю твой ответ и предлагаю свой вариант
4. Если хочешь новую ситуацию — нажми на кнопку снизу

Подробнее про границы можно почитать здесь:
https://skillslab.center/blogs/borders_practice

Начнем?
'''

CHANGE_DECODING_TEXT = "Еще декодирование 🤓"

DECODING_SITUATIONS = [
    "Я могу рассказать тебе о своих проблемах, но знаю, что тебя это не волнует.\n<spoiler>Безразличный</spoiler>",
]

USERS_INFO = {}
